package org.ekstep.platform.language;

import org.ekstep.platform.domain.BaseTest;
import org.json.JSONObject;
import org.junit.Assert;
import org.junit.Test;

import com.jayway.restassured.path.json.JsonPath;
import com.jayway.restassured.response.Response;

import static com.jayway.restassured.RestAssured.given;
import static com.jayway.restassured.http.ContentType.JSON;


public class LessonComplexityTestCases extends BaseTest{
	
	String jsonUpdateSingleTextbook = "{\"request\":{\"gradeLevel\":\"Grade 1\",\"languageLevel\":\"First\",\"source\":\"rajastan\",\"text\":\"चक्कर आओ एक बनाएँ चक्कर फिर उस चक्कर में एक चक्कर फिर उस चक्कर में एक चक्कर फिर उस चक्कर में एक चक्कर और बनाते जाएँ जब तक ऊब न जाएँ थककर। फिर सबसे छोटे चक्कर में म्याऊँ एक बिठाएँ और बाहरी हर चक्कर में चूहों को दौडाएँ दौड़दौड़कर सभी थकें हम बैठें मारे मक्कर, नींद लगे हम सो जाएँ वे देखें उझकउझककर। आओ एक बनाएँ चक्कर। सर्वेश्वर डायल सक्सेना शिक्षक शिक्षिका ले के साथ कविता गाएँ और बच्चों से गवाएँ। चित्रों पर बातचीत करें। चक्कर का खेल खेलाएँ। सोचो और बताओ नीचे लिखी स्थितियों में तुम क्या करोगे? क जब कुत्ता पीछे पद जाए ख जब जंगल में जाते हुए शेर दिख जाए चूहा बिल्ली से डरता है। कौनकिससे डरता है। रेखा खींचकर मिलाओ। चूहा भोड़िया चिड़िया नेवला बकरी बिल्ली साँप शेर खरगोश बाज बच्चे एक के साथ अनेक को मिला सकते हैं। विभिन्न रूप से सक्षम बच्चों के लिए शिक्षक छोत्रों की विशेषताएँ बताएँ। तुम इन्हें अपनी भाषा में क्या कहते हो? नीचे इनके नाम लिखो। घेरा और खेल इस पाठ में चक्कर बनाकर खेल खेलने के बारे में कहा गया है। घेरा बनाकर खेले जाने वाले खेलों में साथियों का हाथ पकड़ते हैं और गीत गाते हैं। तुम भी घेरा बनाकर खेल खेलती होगी। बताओ तुम कौनकौनसे खेल खेलती हो? देखो पढ़ो और समझो चम्मच बिल्ली मक्का उल्लू गन्ना विभिन्न रूप से सक्षम बच्चों के लिए शिक्षक शिक्षिका इनकी विशेषताओं का वर्णन बच्चों की आवश्यकता के अनुसार बोलकर अथवा संकेतों से करें। इसी प्रकार तुम भी शब्द बनाकर बोलो ल्ली से दिल्ली क्का से चक्का न्ना से पन्ना सोचो और लिखो पाठ में चक्कर शब्द आया है। इससे मिलतेजुलते अन्य शब्द बनाकर लिखो और पढ़ो। जैसे शक्कर क्कर मनीची दिए गए खेलों के नाम लिखो। तुम बहुत से खेलों में भागदौड़ करते हो। कुछ खेल ऐसे होते हैं जिनमें बिलकुल भी भागदौड़ नहीं होती है। नीचे सूची में ऐसे खेलों के नाम लिखो। भागदौड़ वाले खेल बिना भागदौड़ वाले खेल कबड्डी साँपसीढ़ी खेलों के नाम लिखने में शिक्षक शिक्षिका बच्चों की मदद करें। विभिन्न रूप से सक्षम बच्चों के लिखे शिक्षक शिक्षिका खेलों का वर्णन करें। बच्चों का बोला हुआ। हाव हुआ मान्य होगा। खाली स्थान में कौनसा शब्द आएगा? लिखो इस पाठ में चक्कर शब्द बार आया है। नौ सत्राज ग्यारह पाठ के अनुसार सबसे छोटे सकककर में बैठाया गया है। चूहा बिल्ली कुत्ता सबसे बड़े चक्कर में दौड़ रहे हैं। चूहे बिल्लियाँ कुत्ते सोचो और लिखो तुम्हे क्या लगता है? दिनभर काम करने के बाद खूब दौड़ने के बाद तुम थकने पर क्या करते हो? भूलभुलैया लड़की को टायर तक पहुुँचाओ। सहपाठी विभिन्न रूप से सक्षम बच्चों का सहयोग करें। जरुरत हो तो शिक्षक शिक्षिका अन्य गतिविधि भी जोड़ें।फिरकी बनाओ सामग्री कोई भी अनुपयोगी कागज़ पुराणी पत्रपत्रिकाओं के पृष्ठ तिनका या कुल्फी की लड़की चरण कागज़ की समान नाप की तीन पट्टियाँ लो। तीनों पट्टियों को दिखाए अनुसार सामान एवं बराबर भागों में मोड़ लो। एक मुड़ी हुई पटटी के ऊपर दूसरी मुड़ी होई पटटी चित्रानुसार जमाओ। चित्र के अनुसार तीनों पट्टियों को गूँथे। तीनों पट्टियों को एक हाथ में पकड़कर दूसरे पत्तियों को खींचो। तीनों पट्टियों को एक एक बार फिर से फिर से ऊपर खींचकर एक कोना तैयार करो। यह हो गई फिरकी तैयार। इस तैयार फिरकी को लड़की के तिनके या कुल्फी की लड़की पर टिकाओ। चित्र के अनुसार फिरकी को चलाओ। विभिन्न रूप से सक्षम बच्चों को अतिरिक्त समय और मदद के जरुरत होती है। सहपाठी और शिक्षक इनका सहयोग करें। म्हारा मांडणोये मांडणे दीवारों व आंगन पर बनाए जाते हैं। ये कली चूना गेरू आदि से बनाए जाते हैं। बच्चों से चर्चा करें एवं दीवारों एवं आंगन में मांडणे बनवाएँ। सबसे पहले बच्चों को ऊपर दी गई सरलतम आकृतियों का अभ्यास करवाएँ। विभिन्न रूप बच्चों के लिए शिक्षक शिक्षिका वर्णन करें।\"}}";
	String jsonTextAnalysisValid = "{\"request\": {\"text\":\"चक्कर आओ एक बनाएँ चक्कर फिर उस चक्कर में एक चक्कर फिर उस चक्कर में एक चक्कर फिर उस चक्कर में एक चक्कर और बनाते जाएँ जब तक ऊब न जाएँ थककर। फिर सबसे छोटे चक्कर में म्याऊँ एक बिठाएँ और बाहरी हर चक्कर में चूहों को दौडाएँ दौड़दौड़कर सभी थकें हम बैठें मारे मक्कर, नींद लगे हम सो जाएँ वे देखें उझकउझककर। आओ एक बनाएँ चक्कर। सर्वेश्वर डायल सक्सेना शिक्षक शिक्षिका ले के साथ कविता गाएँ और बच्चों से गवाएँ। चित्रों पर बातचीत करें। चक्कर का खेल खेलाएँ। सोचो और बताओ नीचे लिखी स्थितियों में तुम क्या करोगे? क जब कुत्ता पीछे पद जाए ख जब जंगल में जाते हुए शेर दिख जाए चूहा बिल्ली से डरता है। कौनकिससे डरता है। रेखा खींचकर मिलाओ। चूहा भोड़िया चिड़िया नेवला बकरी बिल्ली साँप शेर खरगोश बाज बच्चे एक के साथ अनेक को मिला सकते हैं। विभिन्न रूप से सक्षम बच्चों के लिए शिक्षक छोत्रों की विशेषताएँ बताएँ। तुम इन्हें अपनी भाषा में क्या कहते हो?\"}}";
	
	// Get Grade level complexity with valid language
	
	@Test
	public void getGradeLevelComplexityValidExpectSuccess200(){
		
		// Update hindi language with single textbook
		
		setURI();
		given().
			spec(getRequestSpec(contentType, validuserId)).
			body("").
		with().
			contentType(JSON).
		when().
			patch("/v1/language/tools/gradeLevelComplexity/hi/").
		then().
			spec(get200ResponseSpec());

		// Get complexity for same language
		
		setURI();
		Response R = 
		given().
			spec(getRequestSpec(contentType, validuserId)).
		when().	
			get("/v1/language/tools/gradeLevelComplexity/hi").
		then().
			spec(get200ResponseSpec()).
		extract().
			response();
		
		// Extract the response
		JsonPath jPath = R.jsonPath();
		
	}
	
	// Get Grade level complexity with invalid language
	
	@Test
	public void getGradeLevelComplexityInvalidExpect400(){
		
		setURI();
		given().
			spec(getRequestSpec(contentType, validuserId)).
		when().
			get("/v1/language/tools/gradeLevelComplexity/hda").
		then().
			spec(get400ResponseSpec());
	}
	
	// Update grade level complexity with single textbook
	
	@Test
	public void updateComplexitySingleTextbookExpectSuccess200(){
		
		setURI();
		Response R =
		given().
			spec(getRequestSpec(contentType, validuserId)).
			body("").
		with().
			contentType(JSON).
		when().
			patch("/v1/language/tools/gradeLevelComplexity/hi/").
		then().
			spec(get200ResponseSpec()).
		extract().
			response();
		
		// Extract the response
		JsonPath jPath = R.jsonPath();
		Float avgComplexity = jPath.get("result.text_complexity.averageTotalComplexity");
		System.out.println(avgComplexity);		
	}
	
	// Update grade level complexity with multiple textbook

	@Test 
	public void updateComplexityMultipleTextbooksExpectSuccess200(){
		
		// Update the complexity value with single book
		setURI();
			given().
			spec(getRequestSpec(contentType, validuserId)).
			body(jsonUpdateSingleTextbook).
		with().
			contentType(JSON).
		when().
			post("/v1/language/tools/gradeLevelComplexity/hi/").
		then().
			spec(get200ResponseSpec());
		
		//Get the complexity value
		setURI();
		Response R = 
		given().
			spec(getRequestSpec(contentType, validuserId)).
		when().	
			get("/v1/language/tools/gradeLevelComplexity/hi").
		then().
			spec(get200ResponseSpec()).
		extract().
			response();
		
		// Extract the response
		JsonPath jPath = R.jsonPath();
		Float avgComplexity = jPath.get("result.text_complexity.averageTotalComplexity");
		System.out.println(avgComplexity);
		
		// Update text of multiple textbooks
		setURI();
		JSONObject js = new JSONObject(jsonUpdateSingleTextbook);
		js.getJSONObject("request").put("text", "चर्चा करो मेरा गाँव चित्र चर्चा करो खमनोर बस स्टेंड चर्चा करो मेले की मौज़ चर्चा करो बिल्ली और चूहा चित्रों पर बातचीत करें और कहानी बनवाएँ। चर्चा करो रेखा चित्र अंगुली घुमाओ पेंसिल घुमाओ घुमाओ चर्चा करो अंगूठे की चाप बाले चित्र ऊपर बने चित्रों की पहचान कराएँ। इनके बनने की प्रक्रिया पर चर्चा करें। रेखाओं पर पेंसिल घुमवाएँ। कविता गाओ बालगीत आ आ लल्ला ले रसगुल्ला मचा रहा क्यों रो रो हल्ला ले यह दोना अब मत रोना जल्दी खाकर मुँह को धोना पिंकी ने एक पिल्ला पाला कुछकुछ पीला , कुछ-कुछ काला टॉमी उसका सुंदर नाम हाथ उठाओ करे सलाम। सूरज ऐसे चमक रहा है, सोना जैसे दमक रहा है। रातों में यह चिप जाता है, सुबह सवेरे दिखा जाता है। इसके बिना अन्धेरा है, अम्बर इसका डेरा है। चिड़िया के घर न्योता है देखें क्या-क्या होता है मुर्गी चावल लाएगी चिड़िया खीर पकाएगी चिड़िया तुम्हें बुलाएगी मीठी खीर खिलाएगी मुन्नी हो जाओ तैयार देखो चिड़िया का घर-बार मछली तुम हो जल की रानी, रह सकती हो ना बिन पानी। लहर-लहर कर आती हो, मचल-मचल कर जाती हो। करती हो बस तुम मनमानी, मछली रानी, मछली रानी। हुआ सवेरा चिड़ियाँ बोली बच्चों ने तब आँखें खोली अच्छे बच्चे मंजन करते मंजन करके कुल्ला करते कुल्ला करके मुँह को ढोते मुँह धोकर के रोज नहाते रोज नहाकर खाना खाते खाना खाकर पढ़ने जाते। वातावरण निर्माण के लिए बालगीतों को गाएँ । सभा, समारोह, पर्व आदि पर बच्चों से मंच पर प्रस्तुत कराएँ। जिन बालगीतों को आगे बढ़ाया जा सकता है उन्हें आगे बढ़ावाएँ। उमड़-घुमड़ के आए बादल काले, ढोले, नीले बादल बिजली के संग आए बादल आसमान में छाए बादल घड़-घड़-घड़-घड़ करते बादल ताल-तलैया भरते बादल गुड़िया मेरी रानी है, मलगती बड़ी सयानी है। गोरे-गोरे गाल है, लंबे-लंबे बाल हैं। आँखें नीली-नीली हैं, साड़ी पीली-पीली हैं। मैं तो सो रही थी मुझे मुर्ग ने जगाया बोला कुकडूँ-कूँ। मैं तो सो रही थी मुझे बिल्ली ने जगाया बोली म्याऊँ-म्याऊँ। मैं तो सो रही थी मुझे मोटर नइ जगाया बोली पों-पों-पों। मैं तो सो रही थी मुझे अम्मा ने जगाया बोली उठ-उठ-उठ। सड़क बनी है लम्बी चौड़ी जिस पर जाती मोटर दौड़ी स्कूटर भरते है फर्राटे रिक्शा तांगे आते-जाते दुर्घटना से यदि हो बचना बाँयी तरफ हमेशा चलना। चक-चक चैया चक-चक चैया, चक-चक चैया घूम रहा मोटर का पहिया, बैठे उसमें मैं और भैया, नाचें गाएँ, ता ता थैया। बारिश आई भरे तलैया तले पकौड़ी मेरी मैया। तले पकौड़ी मेरी मैया। चक-चक चैया, चक-चक चैया बच्चों के साथ चित्र पर बातचीत करें। जैसे तुमने पहिया कहाँ-कहाँ लगा देखा है? उन चीजों के नाम बताओ, जिनमें पहिया होता है? यदि पहिया नहीं होता तो क्या होता? इनमें से तुमने किसकी सवारी की है। जिसकी सवारी की है, उसे रेखा खींचकर मिलाओ। सुनें और बोलें ऐसे नाम जिनमें मो आता है मोर मोठ मोटा मोल ऐसे नाम जिनमें ट आता है टमाटर टमटम मटर बटन ऐसे नाम जिनमें र आता है रबर रस रहट रजाई मोटर शब्द की पहचान कराएँ मोटर मोटर शब्द की पहचान करो और घेरा लगाओ कार ऊँट मोटर मोटर मोर रेल चक बस मोटर मोटर की पहचान कराएँ पहचानो और रेखा खींचकर मिलाओ पहचानो और घेरा लगाओ मोगरा समोसा अनमोल मोरनी टमाटर फाटक मटका खाट रथ औरत अखबार रमज़ान पढ़ो मोटर मोर लिखो नीचे दिए गए चित्रों में पहिये लगाओ रेल का खेल आओ आओ खेलें खेल, सब जाओ रेल, दो मिलकर इंजिन बन जाओ, छुक-छुक करके रेल चलाओ। झाडी हरी दिखाऊँगी, सीटी तुरन्त बजाऊँगी, तब सब धीरे-धीरे चलना, छुक-छुक करके आगे बढ़ना। बच्चों के साथ चित्र पर बातचीत करें। बच्चों के साथ रेल बनाकर खेल के साथ दोहराएँ। बच्चों के ऐसे नाम बोलने को कहें जिनमें रे और ल की आवाज आती हो। रेल शब्द की पहचान कराएँ रेल रेल शब्द को पहचानो और घेरा लगाओ खेल रेल फल रेल तेल रेल रे और ल की पहचान कराएँ रेल पहचानो और रंग भरो रे में रंग भरो ल में रंग भरो ऐसे नाम जिनमें रे आया हो, उस पर घेरा बनाओ करेला रथ गुब्बारे ऐसे नाम जिनमें ल आया हो, उस पर घेरा बनाओ लड़की फूल लटटू इन नामों में रे और ल पर घेरा बनाओ तारे कल बल दल रेशमा पल नरेश सन्तरे गुब्बारे करेला सुनें और बोलें ऐसे नाम जिनमें र आता है रतन रमकू रमन रजनी ऐसे नाम जिनमें रे आता है रेखा रेशम रेल रेवाड़ी पहचान कराएँ लिखो रेल मोल पेंसिल फेरो और रंग बिरंगी रेल बनाओ रंग भरो चित्र बनाओ अन्य कागज़ पर अंगूठे अँगुलियों की छाप लगवाकर चित्र बनवाएँ। बने हुए चित्रों को कक्षा में प्रदर्शित करें। चर्चा करो जंगल की सैर तीन साथी एक था हाथी। उसकी थी लम्बी सूंड और चौड़े कान उसकी एक दोस्त थी बकरी। दोनों साथ-साथ जंगल में जाते। चित्रों पर इस प्रकार बातचीत करें की कहानी बच्चों के समझ में आ जाए। हाथी डाली झुकाता और बकरी पत्ते चरती। एक दिन दोनों गए जंगल में। वहाँ बेर का पेड़ भी था। हाथी ने पेड़ हिलाया। बकरी जल्दी-जल्दी बेर खाने लगी। उस पेड़ पर चिड़िया का एक घोंसला था। घोंसले से चिड़िया का एक बच्चा पाने में गिरा। बकरी उसे बचाने पानी में गई। वह भी डूबने लगी। हाथी ने दोनों को सूंड से पकड़ा और बाहर निकाला। कुछ दिनों में चिड़िया का बच्चा बड़ा हो गया। वे तीनों दोस्त बन गए। बताओ कहानी में आए तीनों दोस्तों के नाम बताओ। तुम्हारे दोस्त कौन-कौन हैं? तुम भी अपने दोस्तों के नाम बताओ। चित्र देखकर बताओ, इनको क्या-क्या खाना पसन्द है? ऐसे नाम बताओ जो च ब क का से प्रारंभ होते हों चरना चरखा चम्मच चतुर बस बकरा बछड़ा बतख कबूतर कछुआ ककड़ी कमल काजल कान काका कार पहचान कराएँ कान बकरी चरना चित्रों को उनके नाम से मिलाओ। कान मोटर बकरी रेल चम्मच सामान शब्द पर घेरा लगाओ पहचान कराएँ कान बकरी चरना पहचानो और रंग भरो वर्ण को शब्द से मिलाओ कबूतर चमक काला सेब बतख काजल चढ़ाना काचर आ की मात्रा की पहचान कराएँ पहचानो और घेरा लगाओ आ की मात्रा वाले वर्णा पर रात चक मामा काका टर नाना कल लाना टाल टल पढ़ो मोटर रेल काक बकरा लट कल काला लाल बाल चार बाबा केर काका बाला चेला चाट लिखो रेल काक लट बाबा बेर काच लाल बाल काका चाल बाट बचा काका काला चाट चाटा कल देखेंगे ओ रे चींटा मुझे हाथी पीटा काहे से? कान से। तू वहाँ क्यों गया था? खेलने। तुझे खेलने भेजा था कि हाथी को ठेलने। चल अब हाथ मुँह धो ले, खाना खा ले, हाथी को कल देखेंगे इधर ही बुला लेंगे। बच्चों से चर्चा करें- हाथी और चींटा कौनसा खेल खेल रहे होंगे? और हाथी की लड़ाई कैसे हुई होगी? अगर हाथी सामने आ गया तो चींटा उससे क्या बातें करेगा? हाथी व चींटे का मुखौटा लगाकर बातचीत करो। सुनें और बोलें नली कान नथ नीला कील थन हाथी थप्थप थकान थरमस हाथी, कान, हाथ शब्द की पहचान कराएँ हाथी कान हाथ शब्दों को चित्रों से मिलाओ कान हाथ हाथ हाथी हाथी कान पहचान कराऐं हाथी हाथ कान पहचानो और घेरा लगाओ सुनें, बोलें और अन्तर पहचानो कल कील हाथ हाथी पहचानो और घेरा लगाओ नक़ल सफल महल चपल नल नथ सपेरा थकान जमीन नट चहक काला कह चारा करेला ई की मात्रा वाले शब्दों पर घेरा लगाओ चील कील काल नील लीली हील टीन टीका टका लीक पढ़ो कल काल कील चल चाल चील कह कहा कही टक टका टाकी चर चरा चरी थल थाल थाली नर नार नारी नथ नाथ नत्थी लिखो नल नाली नाला टनटन चालाक कटर हीरा थाली चाकरी लहरी कान काला कील काली थाल इनकी आवाज निकालो पेंसिल फेरो और रंग भरो। दाल बाटी चूरमा दाल-बाटी चूरमा, खाकर बन जा सुरमा। दाल दुलारी, सबकी प्यारी, बाटी की तो बातें न्यारी। घी-शक्कर का मेल निराला, बने चूरमा सबसे आला। आओ बाटी दाल बनाएँ, मिलकर सारे मौज मनाएँ। बच्चों से चर्चा करें। आपके घर में दाल बाटी चूरमा कब-कब बनाया जाता है? बाटी की जैसे खाने की कौन-कौनसी चीजों गोल होती है? पहचानो दाल चूरमा आओ पहचानो और घेरा लगाओ दरवाजा सफ़ेद दाद दल मल मन रमन मदन आम बुआ आई आजा ओला ओज ओर आओ चित्र को उनके नाम से मिलाओ टमाटर	थाली	रथ	कान	हाथी	आम	बगुला	दरवाज़ा तुम्हें जो खाना अच्छा लगता है। उसे रेखा खींचकर मिलाओ पढ़ो आओ आम दाम बादल बाल हाथ बनाओ मदद मलहम दलबल मकान महल काले बादल आओ ना। हाथी बनकर आओ ना। लगाकर शब्द बनाओ कान मात्रा लगाकर शब्द बनाओ आ की मात्रा से ई की मात्रा से चीनी कहानी ए की मात्र से हरे मेरे चरे काले चले दिए गए वर्णा मात्राओं शब्द बनाओ लट हाथी दिए गए शब्दों से वाक्य बनाओ दादारेल मोटर मामा चलाओ आओ मोना लाओ थाली चली हाथी चला टमाटर कल नल था मामा मोटर लाओ। अपनी पसंद का चित्र बनाओ और उसमें रंग भरो चर्चा करो बाजार चलें टिपिक-पाँ-फुर्र हम स्कूल में आते ही खेलते हैं। भाग-दौड़ करते हैं। लटकते हैं। खिड़की की जालियों पर चढ़ाते हैं। बैठते हैं। उठते हैं। हाथ हिलाते हैं। पाँव हिलाते हैं। पंजों पर चलते हैं। फिर गोला बनाकर बैठ जाते हैं। प्रार्थना के समय आँख बंद कर लेते हैं। हल्के से आँख खोलकर देख भी लेते हैं। प्रार्थना के बाद कुछ देर चुपचाप बैठना होता है। बच्चों से बातचीत करें। तुम कौन-कौनसे खेल खेलते हो? कौनसे खेलो में तुम्हे खेल सामत्री की जरुरत पड़ती है? बिना खेल सामग्री के कौनसे खेल खेले जा सकते है? विभिन्न की आवाजों से बच्चों को परिचित करवाएँ जैसे टपकता पानी पक्षियों के उड़ने की आवाजें गाड़ी के हॉर्न की आवाज स्कूल की घण्टी की आवाज आदि। चुपचाप यानी एकदम चुपचाप। कोई भी कुछ नहीं बोलता। सब एकदम चुप। फिर न जाने क्या-क्या सुनाई देता है। क्या सुनाई देता है? यह हर कोई बताता है। टिपिक, टिपिक फुर्र, फुर्र पाँ, पाँ टन, टन डम, डम अगर तुम भी थोड़ी देर आँख बंद करके बैठोगे तो तुम्हें भी बहुत कुछ सुनाई देगा। सुनें और बोलें आँख खिड़की चखना सड़क खिचड़ी खटिया आँख, खिड़की शब्दों की पहचान कराएँ आँख खिड़की पहचान कराएँ आँख खिड़की पहचानो और रंग भरो ख वाले खाने में खि वाले खाने में रंग भरो ख वाले गुब्बारे में पहचानो और घेरा लगाओ खरबूजा चखना खजूर माखन राख भेड़ मेड़ गुड़ सड़क लड़की इ की मात्र वाले वर्णा पर घेरा लगाओ किवाड़ गिलास गिलहरी गिनती चिमनी मिलना सिखाना महिला कपिल समाधि पढ़ो खरल दाखिल राखी खड़खड़ खड़े नाड़ा लड़का कड़कड़ खड़िया टिकटिक खट-खट नमक बिकना बिका निहार किचकिच नीम बालक नानक थाली लिखो चिमनी किला लड़की खिड़की खीरा महिला खिचड़ी किलकारी लाल नीले हरा काले बताओ, ये कैसी-कैसी आवाज़ें करते हैं? नाम लिखो");
		String jsonUpdateMultipleTextbook = js.toString();
		given().
			spec(getRequestSpec(contentType, validuserId)).
			body(jsonUpdateMultipleTextbook).
		with().
			contentType(JSON).
		when().
			post("/v1/language/tools/gradeLevelComplexity/hi/").
		then().
			spec(get200ResponseSpec());
		
		//Get the complexity value
		setURI();
		Response R2 = 
		given().
			spec(getRequestSpec(contentType, validuserId)).
		when().	
			get("/v1/language/tools/gradeLevelComplexity/hi").
		then().
			spec(get200ResponseSpec()).
		extract().
			response();
		
		// Extract the response
		JsonPath jPath2 = R2.jsonPath();
		Float avgComplexity2 = jPath2.get("result.text_complexity.averageTotalComplexity");
		Assert.assertFalse(avgComplexity.equals(avgComplexity2));
		System.out.println(avgComplexity2);
	}
	
	// Update grade level complexity with value of second language higher than first language
	
	@Test
	public void updateInvalidComplexityValuesWithLanguage(){

		// Update the complexity value for first language	
		setURI();
		given().
			spec(getRequestSpec(contentType, validuserId)).
			body(jsonUpdateSingleTextbook).
		with().
			contentType(JSON).
		when().
			post("/v1/language/tools/gradeLevelComplexity/hi/").
		then().
			spec(get200ResponseSpec());
		
		//Get the complexity value
		setURI();
		Response R = 
		given().
			spec(getRequestSpec(contentType, validuserId)).
		when().	
			get("/v1/language/tools/gradeLevelComplexity/hi").
		then().
			spec(get200ResponseSpec()).
		extract().
			response();
		
		// Extract the response
		JsonPath jPath = R.jsonPath();
		Float avgComplexity = jPath.get("result.text_complexity.averageTotalComplexity");
		System.out.println(avgComplexity);
		
		// Update the complexity value for second language
		setURI();
		JSONObject js = new JSONObject(jsonUpdateSingleTextbook);
		js.getJSONObject("request").put("languageLevel","Second").put("text", "चर्चा करो मेरा गाँव चित्र चर्चा करो खमनोर बस स्टेंड चर्चा करो मेले की मौज़ चर्चा करो बिल्ली और चूहा चित्रों पर बातचीत करें और कहानी बनवाएँ। चर्चा करो रेखा चित्र अंगुली घुमाओ पेंसिल घुमाओ घुमाओ चर्चा करो अंगूठे की चाप बाले चित्र ऊपर बने चित्रों की पहचान कराएँ। इनके बनने की प्रक्रिया पर चर्चा करें। रेखाओं पर पेंसिल घुमवाएँ। कविता गाओ बालगीत आ आ लल्ला ले रसगुल्ला मचा रहा क्यों रो रो हल्ला ले यह दोना अब मत रोना जल्दी खाकर मुँह को धोना पिंकी ने एक पिल्ला पाला कुछकुछ पीला , कुछ-कुछ काला टॉमी उसका सुंदर नाम हाथ उठाओ करे सलाम। सूरज ऐसे चमक रहा है, सोना जैसे दमक रहा है। रातों में यह चिप जाता है, सुबह सवेरे दिखा जाता है। इसके बिना अन्धेरा है, अम्बर इसका डेरा है। चिड़िया के घर न्योता है देखें क्या-क्या होता है मुर्गी चावल लाएगी चिड़िया खीर पकाएगी चिड़िया तुम्हें बुलाएगी मीठी खीर खिलाएगी मुन्नी हो जाओ तैयार देखो चिड़िया का घर-बार मछली तुम हो जल की रानी, रह सकती हो ना बिन पानी। लहर-लहर कर आती हो, मचल-मचल कर जाती हो। करती हो बस तुम मनमानी, मछली रानी, मछली रानी। हुआ सवेरा चिड़ियाँ बोली बच्चों ने तब आँखें खोली अच्छे बच्चे मंजन करते मंजन करके कुल्ला करते कुल्ला करके मुँह को ढोते मुँह धोकर के रोज नहाते रोज नहाकर खाना खाते खाना खाकर पढ़ने जाते। वातावरण निर्माण के लिए बालगीतों को गाएँ । सभा, समारोह, पर्व आदि पर बच्चों से मंच पर प्रस्तुत कराएँ। जिन बालगीतों को आगे बढ़ाया जा सकता है उन्हें आगे बढ़ावाएँ। उमड़-घुमड़ के आए बादल काले, ढोले, नीले बादल बिजली के संग आए बादल आसमान में छाए बादल घड़-घड़-घड़-घड़ करते बादल ताल-तलैया भरते बादल गुड़िया मेरी रानी है, मलगती बड़ी सयानी है। गोरे-गोरे गाल है, लंबे-लंबे बाल हैं। आँखें नीली-नीली हैं, साड़ी पीली-पीली हैं। मैं तो सो रही थी मुझे मुर्ग ने जगाया बोला कुकडूँ-कूँ। मैं तो सो रही थी मुझे बिल्ली ने जगाया बोली म्याऊँ-म्याऊँ। मैं तो सो रही थी मुझे मोटर नइ जगाया बोली पों-पों-पों। मैं तो सो रही थी मुझे अम्मा ने जगाया बोली उठ-उठ-उठ। सड़क बनी है लम्बी चौड़ी जिस पर जाती मोटर दौड़ी स्कूटर भरते है फर्राटे रिक्शा तांगे आते-जाते दुर्घटना से यदि हो बचना बाँयी तरफ हमेशा चलना। चक-चक चैया चक-चक चैया, चक-चक चैया घूम रहा मोटर का पहिया, बैठे उसमें मैं और भैया, नाचें गाएँ, ता ता थैया। बारिश आई भरे तलैया तले पकौड़ी मेरी मैया। तले पकौड़ी मेरी मैया। चक-चक चैया, चक-चक चैया बच्चों के साथ चित्र पर बातचीत करें। जैसे तुमने पहिया कहाँ-कहाँ लगा देखा है? उन चीजों के नाम बताओ, जिनमें पहिया होता है? यदि पहिया नहीं होता तो क्या होता? इनमें से तुमने किसकी सवारी की है। जिसकी सवारी की है, उसे रेखा खींचकर मिलाओ। सुनें और बोलें ऐसे नाम जिनमें मो आता है मोर मोठ मोटा मोल ऐसे नाम जिनमें ट आता है टमाटर टमटम मटर बटन ऐसे नाम जिनमें र आता है रबर रस रहट रजाई मोटर शब्द की पहचान कराएँ मोटर मोटर शब्द की पहचान करो और घेरा लगाओ कार ऊँट मोटर मोटर मोर रेल चक बस मोटर मोटर की पहचान कराएँ पहचानो और रेखा खींचकर मिलाओ पहचानो और घेरा लगाओ मोगरा समोसा अनमोल मोरनी टमाटर फाटक मटका खाट रथ औरत अखबार रमज़ान पढ़ो मोटर मोर लिखो नीचे दिए गए चित्रों में पहिये लगाओ रेल का खेल आओ आओ खेलें खेल, सब जाओ रेल, दो मिलकर इंजिन बन जाओ, छुक-छुक करके रेल चलाओ। झाडी हरी दिखाऊँगी, सीटी तुरन्त बजाऊँगी, तब सब धीरे-धीरे चलना, छुक-छुक करके आगे बढ़ना। बच्चों के साथ चित्र पर बातचीत करें। बच्चों के साथ रेल बनाकर खेल के साथ दोहराएँ। बच्चों के ऐसे नाम बोलने को कहें जिनमें रे और ल की आवाज आती हो। रेल शब्द की पहचान कराएँ रेल रेल शब्द को पहचानो और घेरा लगाओ खेल रेल फल रेल तेल रेल रे और ल की पहचान कराएँ रेल पहचानो और रंग भरो रे में रंग भरो ल में रंग भरो ऐसे नाम जिनमें रे आया हो, उस पर घेरा बनाओ करेला रथ गुब्बारे ऐसे नाम जिनमें ल आया हो, उस पर घेरा बनाओ लड़की फूल लटटू इन नामों में रे और ल पर घेरा बनाओ तारे कल बल दल रेशमा पल नरेश सन्तरे गुब्बारे करेला सुनें और बोलें ऐसे नाम जिनमें र आता है रतन रमकू रमन रजनी ऐसे नाम जिनमें रे आता है रेखा रेशम रेल रेवाड़ी पहचान कराएँ लिखो रेल मोल पेंसिल फेरो और रंग बिरंगी रेल बनाओ रंग भरो चित्र बनाओ अन्य कागज़ पर अंगूठे अँगुलियों की छाप लगवाकर चित्र बनवाएँ। बने हुए चित्रों को कक्षा में प्रदर्शित करें। चर्चा करो जंगल की सैर तीन साथी एक था हाथी। उसकी थी लम्बी सूंड और चौड़े कान उसकी एक दोस्त थी बकरी। दोनों साथ-साथ जंगल में जाते। चित्रों पर इस प्रकार बातचीत करें की कहानी बच्चों के समझ में आ जाए। हाथी डाली झुकाता और बकरी पत्ते चरती। एक दिन दोनों गए जंगल में। वहाँ बेर का पेड़ भी था। हाथी ने पेड़ हिलाया। बकरी जल्दी-जल्दी बेर खाने लगी। उस पेड़ पर चिड़िया का एक घोंसला था। घोंसले से चिड़िया का एक बच्चा पाने में गिरा। बकरी उसे बचाने पानी में गई। वह भी डूबने लगी। हाथी ने दोनों को सूंड से पकड़ा और बाहर निकाला। कुछ दिनों में चिड़िया का बच्चा बड़ा हो गया। वे तीनों दोस्त बन गए। बताओ कहानी में आए तीनों दोस्तों के नाम बताओ। तुम्हारे दोस्त कौन-कौन हैं? तुम भी अपने दोस्तों के नाम बताओ। चित्र देखकर बताओ, इनको क्या-क्या खाना पसन्द है? ऐसे नाम बताओ जो च ब क का से प्रारंभ होते हों चरना चरखा चम्मच चतुर बस बकरा बछड़ा बतख कबूतर कछुआ ककड़ी कमल काजल कान काका कार पहचान कराएँ कान बकरी चरना चित्रों को उनके नाम से मिलाओ। कान मोटर बकरी रेल चम्मच सामान शब्द पर घेरा लगाओ पहचान कराएँ कान बकरी चरना पहचानो और रंग भरो वर्ण को शब्द से मिलाओ कबूतर चमक काला सेब बतख काजल चढ़ाना काचर आ की मात्रा की पहचान कराएँ पहचानो और घेरा लगाओ आ की मात्रा वाले वर्णा पर रात चक मामा काका टर नाना कल लाना टाल टल पढ़ो मोटर रेल काक बकरा लट कल काला लाल बाल चार बाबा केर काका बाला चेला चाट लिखो रेल काक लट बाबा बेर काच लाल बाल काका चाल बाट बचा काका काला चाट चाटा कल देखेंगे ओ रे चींटा मुझे हाथी पीटा काहे से? कान से। तू वहाँ क्यों गया था? खेलने। तुझे खेलने भेजा था कि हाथी को ठेलने। चल अब हाथ मुँह धो ले, खाना खा ले, हाथी को कल देखेंगे इधर ही बुला लेंगे। बच्चों से चर्चा करें- हाथी और चींटा कौनसा खेल खेल रहे होंगे? और हाथी की लड़ाई कैसे हुई होगी? अगर हाथी सामने आ गया तो चींटा उससे क्या बातें करेगा? हाथी व चींटे का मुखौटा लगाकर बातचीत करो। सुनें और बोलें नली कान नथ नीला कील थन हाथी थप्थप थकान थरमस हाथी, कान, हाथ शब्द की पहचान कराएँ हाथी कान हाथ शब्दों को चित्रों से मिलाओ कान हाथ हाथ हाथी हाथी कान पहचान कराऐं हाथी हाथ कान पहचानो और घेरा लगाओ सुनें, बोलें और अन्तर पहचानो कल कील हाथ हाथी पहचानो और घेरा लगाओ नक़ल सफल महल चपल नल नथ सपेरा थकान जमीन नट चहक काला कह चारा करेला ई की मात्रा वाले शब्दों पर घेरा लगाओ चील कील काल नील लीली हील टीन टीका टका लीक पढ़ो कल काल कील चल चाल चील कह कहा कही टक टका टाकी चर चरा चरी थल थाल थाली नर नार नारी नथ नाथ नत्थी लिखो नल नाली नाला टनटन चालाक कटर हीरा थाली चाकरी लहरी कान काला कील काली थाल इनकी आवाज निकालो पेंसिल फेरो और रंग भरो। दाल बाटी चूरमा दाल-बाटी चूरमा, खाकर बन जा सुरमा। दाल दुलारी, सबकी प्यारी, बाटी की तो बातें न्यारी। घी-शक्कर का मेल निराला, बने चूरमा सबसे आला। आओ बाटी दाल बनाएँ, मिलकर सारे मौज मनाएँ। बच्चों से चर्चा करें। आपके घर में दाल बाटी चूरमा कब-कब बनाया जाता है? बाटी की जैसे खाने की कौन-कौनसी चीजों गोल होती है? पहचानो दाल चूरमा आओ पहचानो और घेरा लगाओ दरवाजा सफ़ेद दाद दल मल मन रमन मदन आम बुआ आई आजा ओला ओज ओर आओ चित्र को उनके नाम से मिलाओ टमाटर	थाली	रथ	कान	हाथी	आम	बगुला	दरवाज़ा तुम्हें जो खाना अच्छा लगता है। उसे रेखा खींचकर मिलाओ पढ़ो आओ आम दाम बादल बाल हाथ बनाओ मदद मलहम दलबल मकान महल काले बादल आओ ना। हाथी बनकर आओ ना। लगाकर शब्द बनाओ कान मात्रा लगाकर शब्द बनाओ आ की मात्रा से ई की मात्रा से चीनी कहानी ए की मात्र से हरे मेरे चरे काले चले दिए गए वर्णा मात्राओं शब्द बनाओ लट हाथी दिए गए शब्दों से वाक्य बनाओ दादारेल मोटर मामा चलाओ आओ मोना लाओ थाली चली हाथी चला टमाटर कल नल था मामा मोटर लाओ। अपनी पसंद का चित्र बनाओ और उसमें रंग भरो चर्चा करो बाजार चलें टिपिक-पाँ-फुर्र हम स्कूल में आते ही खेलते हैं। भाग-दौड़ करते हैं। लटकते हैं। खिड़की की जालियों पर चढ़ाते हैं। बैठते हैं। उठते हैं। हाथ हिलाते हैं। पाँव हिलाते हैं। पंजों पर चलते हैं। फिर गोला बनाकर बैठ जाते हैं। प्रार्थना के समय आँख बंद कर लेते हैं। हल्के से आँख खोलकर देख भी लेते हैं। प्रार्थना के बाद कुछ देर चुपचाप बैठना होता है। बच्चों से बातचीत करें। तुम कौन-कौनसे खेल खेलते हो? कौनसे खेलो में तुम्हे खेल सामत्री की जरुरत पड़ती है? बिना खेल सामग्री के कौनसे खेल खेले जा सकते है? विभिन्न की आवाजों से बच्चों को परिचित करवाएँ जैसे टपकता पानी पक्षियों के उड़ने की आवाजें गाड़ी के हॉर्न की आवाज स्कूल की घण्टी की आवाज आदि। चुपचाप यानी एकदम चुपचाप। कोई भी कुछ नहीं बोलता। सब एकदम चुप। फिर न जाने क्या-क्या सुनाई देता है। क्या सुनाई देता है? यह हर कोई बताता है। टिपिक, टिपिक फुर्र, फुर्र पाँ, पाँ टन, टन डम, डम अगर तुम भी थोड़ी देर आँख बंद करके बैठोगे तो तुम्हें भी बहुत कुछ सुनाई देगा। सुनें और बोलें आँख खिड़की चखना सड़क खिचड़ी खटिया आँख, खिड़की शब्दों की पहचान कराएँ आँख खिड़की पहचान कराएँ आँख खिड़की पहचानो और रंग भरो ख वाले खाने में खि वाले खाने में रंग भरो ख वाले गुब्बारे में पहचानो और घेरा लगाओ खरबूजा चखना खजूर माखन राख भेड़ मेड़ गुड़ सड़क लड़की इ की मात्र वाले वर्णा पर घेरा लगाओ किवाड़ गिलास गिलहरी गिनती चिमनी मिलना सिखाना महिला कपिल समाधि पढ़ो खरल दाखिल राखी खड़खड़ खड़े नाड़ा लड़का कड़कड़ खड़िया टिकटिक खट-खट नमक बिकना बिका निहार किचकिच नीम बालक नानक थाली लिखो चिमनी किला लड़की खिड़की खीरा महिला खिचड़ी किलकारी लाल नीले हरा काले बताओ, ये कैसी-कैसी आवाज़ें करते हैं? नाम लिखो");
		String jsonUpdateSecondLanguage = js.toString();
		given().
			spec(getRequestSpec(contentType, validuserId)).
			body(jsonUpdateSecondLanguage).
		with().
			contentType(JSON).
		when().
			post("/v1/language/tools/gradeLevelComplexity/hi/").
		then().
			spec(get400ResponseSpec());
		}

	// Update complexity with value of grade-1 first language higher than grade-2 first language
	
	@Test
	public void updateInvalidComplexitValuesWithGrade(){
		
		// Update the complexity value for grade-2 first language	
		setURI();
		JSONObject js = new JSONObject(jsonUpdateSingleTextbook);
		js.getJSONObject("request").put("gradeLevel","Grade 2").put("text", "चर्चा करो मेरा गाँव चित्र चर्चा करो खमनोर बस स्टेंड चर्चा करो मेले की मौज़ चर्चा करो बिल्ली और चूहा चित्रों पर बातचीत करें और कहानी बनवाएँ। चर्चा करो रेखा चित्र अंगुली घुमाओ पेंसिल घुमाओ घुमाओ चर्चा करो अंगूठे की चाप बाले चित्र ऊपर बने चित्रों की पहचान कराएँ। इनके बनने की प्रक्रिया पर चर्चा करें। रेखाओं पर पेंसिल घुमवाएँ। कविता गाओ बालगीत आ आ लल्ला ले रसगुल्ला मचा रहा क्यों रो रो हल्ला ले यह दोना अब मत रोना जल्दी खाकर मुँह को धोना पिंकी ने एक पिल्ला पाला कुछकुछ पीला , कुछ-कुछ काला टॉमी उसका सुंदर नाम हाथ उठाओ करे सलाम। सूरज ऐसे चमक रहा है, सोना जैसे दमक रहा है। रातों में यह चिप जाता है, सुबह सवेरे दिखा जाता है। इसके बिना अन्धेरा है, अम्बर इसका डेरा है। चिड़िया के घर न्योता है देखें क्या-क्या होता है मुर्गी चावल लाएगी चिड़िया खीर पकाएगी चिड़िया तुम्हें बुलाएगी मीठी खीर खिलाएगी मुन्नी हो जाओ तैयार देखो चिड़िया का घर-बार मछली तुम हो जल की रानी, रह सकती हो ना बिन पानी। लहर-लहर कर आती हो, मचल-मचल कर जाती हो। करती हो बस तुम मनमानी, मछली रानी, मछली रानी। हुआ सवेरा चिड़ियाँ बोली बच्चों ने तब आँखें खोली अच्छे बच्चे मंजन करते मंजन करके कुल्ला करते कुल्ला करके मुँह को ढोते मुँह धोकर के रोज नहाते रोज नहाकर खाना खाते खाना खाकर पढ़ने जाते। वातावरण निर्माण के लिए बालगीतों को गाएँ । सभा, समारोह, पर्व आदि पर बच्चों से मंच पर प्रस्तुत कराएँ। जिन बालगीतों को आगे बढ़ाया जा सकता है उन्हें आगे बढ़ावाएँ। उमड़-घुमड़ के आए बादल काले, ढोले, नीले बादल बिजली के संग आए बादल आसमान में छाए बादल घड़-घड़-घड़-घड़ करते बादल ताल-तलैया भरते बादल गुड़िया मेरी रानी है, मलगती बड़ी सयानी है। गोरे-गोरे गाल है, लंबे-लंबे बाल हैं। आँखें नीली-नीली हैं, साड़ी पीली-पीली हैं। मैं तो सो रही थी मुझे मुर्ग ने जगाया बोला कुकडूँ-कूँ। मैं तो सो रही थी मुझे बिल्ली ने जगाया बोली म्याऊँ-म्याऊँ। मैं तो सो रही थी मुझे मोटर नइ जगाया बोली पों-पों-पों। मैं तो सो रही थी मुझे अम्मा ने जगाया बोली उठ-उठ-उठ। सड़क बनी है लम्बी चौड़ी जिस पर जाती मोटर दौड़ी स्कूटर भरते है फर्राटे रिक्शा तांगे आते-जाते दुर्घटना से यदि हो बचना बाँयी तरफ हमेशा चलना। चक-चक चैया चक-चक चैया, चक-चक चैया घूम रहा मोटर का पहिया, बैठे उसमें मैं और भैया, नाचें गाएँ, ता ता थैया। बारिश आई भरे तलैया तले पकौड़ी मेरी मैया। तले पकौड़ी मेरी मैया। चक-चक चैया, चक-चक चैया बच्चों के साथ चित्र पर बातचीत करें। जैसे तुमने पहिया कहाँ-कहाँ लगा देखा है? उन चीजों के नाम बताओ, जिनमें पहिया होता है? यदि पहिया नहीं होता तो क्या होता? इनमें से तुमने किसकी सवारी की है। जिसकी सवारी की है, उसे रेखा खींचकर मिलाओ। सुनें और बोलें ऐसे नाम जिनमें मो आता है मोर मोठ मोटा मोल ऐसे नाम जिनमें ट आता है टमाटर टमटम मटर बटन ऐसे नाम जिनमें र आता है रबर रस रहट रजाई मोटर शब्द की पहचान कराएँ मोटर मोटर शब्द की पहचान करो और घेरा लगाओ कार ऊँट मोटर मोटर मोर रेल चक बस मोटर मोटर की पहचान कराएँ पहचानो और रेखा खींचकर मिलाओ पहचानो और घेरा लगाओ मोगरा समोसा अनमोल मोरनी टमाटर फाटक मटका खाट रथ औरत अखबार रमज़ान पढ़ो मोटर मोर लिखो नीचे दिए गए चित्रों में पहिये लगाओ रेल का खेल आओ आओ खेलें खेल, सब जाओ रेल, दो मिलकर इंजिन बन जाओ, छुक-छुक करके रेल चलाओ। झाडी हरी दिखाऊँगी, सीटी तुरन्त बजाऊँगी, तब सब धीरे-धीरे चलना, छुक-छुक करके आगे बढ़ना। बच्चों के साथ चित्र पर बातचीत करें। बच्चों के साथ रेल बनाकर खेल के साथ दोहराएँ। बच्चों के ऐसे नाम बोलने को कहें जिनमें रे और ल की आवाज आती हो। रेल शब्द की पहचान कराएँ रेल रेल शब्द को पहचानो और घेरा लगाओ खेल रेल फल रेल तेल रेल रे और ल की पहचान कराएँ रेल पहचानो और रंग भरो रे में रंग भरो ल में रंग भरो ऐसे नाम जिनमें रे आया हो, उस पर घेरा बनाओ करेला रथ गुब्बारे ऐसे नाम जिनमें ल आया हो, उस पर घेरा बनाओ लड़की फूल लटटू इन नामों में रे और ल पर घेरा बनाओ तारे कल बल दल रेशमा पल नरेश सन्तरे गुब्बारे करेला सुनें और बोलें ऐसे नाम जिनमें र आता है रतन रमकू रमन रजनी ऐसे नाम जिनमें रे आता है रेखा रेशम रेल रेवाड़ी पहचान कराएँ लिखो रेल मोल पेंसिल फेरो और रंग बिरंगी रेल बनाओ रंग भरो चित्र बनाओ अन्य कागज़ पर अंगूठे अँगुलियों की छाप लगवाकर चित्र बनवाएँ। बने हुए चित्रों को कक्षा में प्रदर्शित करें। चर्चा करो जंगल की सैर तीन साथी एक था हाथी। उसकी थी लम्बी सूंड और चौड़े कान उसकी एक दोस्त थी बकरी। दोनों साथ-साथ जंगल में जाते। चित्रों पर इस प्रकार बातचीत करें की कहानी बच्चों के समझ में आ जाए। हाथी डाली झुकाता और बकरी पत्ते चरती। एक दिन दोनों गए जंगल में। वहाँ बेर का पेड़ भी था। हाथी ने पेड़ हिलाया। बकरी जल्दी-जल्दी बेर खाने लगी। उस पेड़ पर चिड़िया का एक घोंसला था। घोंसले से चिड़िया का एक बच्चा पाने में गिरा। बकरी उसे बचाने पानी में गई। वह भी डूबने लगी। हाथी ने दोनों को सूंड से पकड़ा और बाहर निकाला। कुछ दिनों में चिड़िया का बच्चा बड़ा हो गया। वे तीनों दोस्त बन गए। बताओ कहानी में आए तीनों दोस्तों के नाम बताओ। तुम्हारे दोस्त कौन-कौन हैं? तुम भी अपने दोस्तों के नाम बताओ। चित्र देखकर बताओ, इनको क्या-क्या खाना पसन्द है? ऐसे नाम बताओ जो च ब क का से प्रारंभ होते हों चरना चरखा चम्मच चतुर बस बकरा बछड़ा बतख कबूतर कछुआ ककड़ी कमल काजल कान काका कार पहचान कराएँ कान बकरी चरना चित्रों को उनके नाम से मिलाओ। कान मोटर बकरी रेल चम्मच सामान शब्द पर घेरा लगाओ पहचान कराएँ कान बकरी चरना पहचानो और रंग भरो वर्ण को शब्द से मिलाओ कबूतर चमक काला सेब बतख काजल चढ़ाना काचर आ की मात्रा की पहचान कराएँ पहचानो और घेरा लगाओ आ की मात्रा वाले वर्णा पर रात चक मामा काका टर नाना कल लाना टाल टल पढ़ो मोटर रेल काक बकरा लट कल काला लाल बाल चार बाबा केर काका बाला चेला चाट लिखो रेल काक लट बाबा बेर काच लाल बाल काका चाल बाट बचा काका काला चाट चाटा कल देखेंगे ओ रे चींटा मुझे हाथी पीटा काहे से? कान से। तू वहाँ क्यों गया था? खेलने। तुझे खेलने भेजा था कि हाथी को ठेलने। चल अब हाथ मुँह धो ले, खाना खा ले, हाथी को कल देखेंगे इधर ही बुला लेंगे। बच्चों से चर्चा करें- हाथी और चींटा कौनसा खेल खेल रहे होंगे? और हाथी की लड़ाई कैसे हुई होगी? अगर हाथी सामने आ गया तो चींटा उससे क्या बातें करेगा? हाथी व चींटे का मुखौटा लगाकर बातचीत करो। सुनें और बोलें नली कान नथ नीला कील थन हाथी थप्थप थकान थरमस हाथी, कान, हाथ शब्द की पहचान कराएँ हाथी कान हाथ शब्दों को चित्रों से मिलाओ कान हाथ हाथ हाथी हाथी कान पहचान कराऐं हाथी हाथ कान पहचानो और घेरा लगाओ सुनें, बोलें और अन्तर पहचानो कल कील हाथ हाथी पहचानो और घेरा लगाओ नक़ल सफल महल चपल नल नथ सपेरा थकान जमीन नट चहक काला कह चारा करेला ई की मात्रा वाले शब्दों पर घेरा लगाओ चील कील काल नील लीली हील टीन टीका टका लीक पढ़ो कल काल कील चल चाल चील कह कहा कही टक टका टाकी चर चरा चरी थल थाल थाली नर नार नारी नथ नाथ नत्थी लिखो नल नाली नाला टनटन चालाक कटर हीरा थाली चाकरी लहरी कान काला कील काली थाल इनकी आवाज निकालो पेंसिल फेरो और रंग भरो। दाल बाटी चूरमा दाल-बाटी चूरमा, खाकर बन जा सुरमा। दाल दुलारी, सबकी प्यारी, बाटी की तो बातें न्यारी। घी-शक्कर का मेल निराला, बने चूरमा सबसे आला। आओ बाटी दाल बनाएँ, मिलकर सारे मौज मनाएँ। बच्चों से चर्चा करें। आपके घर में दाल बाटी चूरमा कब-कब बनाया जाता है? बाटी की जैसे खाने की कौन-कौनसी चीजों गोल होती है? पहचानो दाल चूरमा आओ पहचानो और घेरा लगाओ दरवाजा सफ़ेद दाद दल मल मन रमन मदन आम बुआ आई आजा ओला ओज ओर आओ चित्र को उनके नाम से मिलाओ टमाटर	थाली	रथ	कान	हाथी	आम	बगुला	दरवाज़ा तुम्हें जो खाना अच्छा लगता है। उसे रेखा खींचकर मिलाओ पढ़ो आओ आम दाम बादल बाल हाथ बनाओ मदद मलहम दलबल मकान महल काले बादल आओ ना। हाथी बनकर आओ ना। लगाकर शब्द बनाओ कान मात्रा लगाकर शब्द बनाओ आ की मात्रा से ई की मात्रा से चीनी कहानी ए की मात्र से हरे मेरे चरे काले चले दिए गए वर्णा मात्राओं शब्द बनाओ लट हाथी दिए गए शब्दों से वाक्य बनाओ दादारेल मोटर मामा चलाओ आओ मोना लाओ थाली चली हाथी चला टमाटर कल नल था मामा मोटर लाओ। अपनी पसंद का चित्र बनाओ और उसमें रंग भरो चर्चा करो बाजार चलें टिपिक-पाँ-फुर्र हम स्कूल में आते ही खेलते हैं। भाग-दौड़ करते हैं। लटकते हैं। खिड़की की जालियों पर चढ़ाते हैं। बैठते हैं। उठते हैं। हाथ हिलाते हैं। पाँव हिलाते हैं। पंजों पर चलते हैं। फिर गोला बनाकर बैठ जाते हैं। प्रार्थना के समय आँख बंद कर लेते हैं। हल्के से आँख खोलकर देख भी लेते हैं। प्रार्थना के बाद कुछ देर चुपचाप बैठना होता है। बच्चों से बातचीत करें। तुम कौन-कौनसे खेल खेलते हो? कौनसे खेलो में तुम्हे खेल सामत्री की जरुरत पड़ती है? बिना खेल सामग्री के कौनसे खेल खेले जा सकते है? विभिन्न की आवाजों से बच्चों को परिचित करवाएँ जैसे टपकता पानी पक्षियों के उड़ने की आवाजें गाड़ी के हॉर्न की आवाज स्कूल की घण्टी की आवाज आदि। चुपचाप यानी एकदम चुपचाप। कोई भी कुछ नहीं बोलता। सब एकदम चुप। फिर न जाने क्या-क्या सुनाई देता है। क्या सुनाई देता है? यह हर कोई बताता है। टिपिक, टिपिक फुर्र, फुर्र पाँ, पाँ टन, टन डम, डम अगर तुम भी थोड़ी देर आँख बंद करके बैठोगे तो तुम्हें भी बहुत कुछ सुनाई देगा। सुनें और बोलें आँख खिड़की चखना सड़क खिचड़ी खटिया आँख, खिड़की शब्दों की पहचान कराएँ आँख खिड़की पहचान कराएँ आँख खिड़की पहचानो और रंग भरो ख वाले खाने में खि वाले खाने में रंग भरो ख वाले गुब्बारे में पहचानो और घेरा लगाओ खरबूजा चखना खजूर माखन राख भेड़ मेड़ गुड़ सड़क लड़की इ की मात्र वाले वर्णा पर घेरा लगाओ किवाड़ गिलास गिलहरी गिनती चिमनी मिलना सिखाना महिला कपिल समाधि पढ़ो खरल दाखिल राखी खड़खड़ खड़े नाड़ा लड़का कड़कड़ खड़िया टिकटिक खट-खट नमक बिकना बिका निहार किचकिच नीम बालक नानक थाली लिखो चिमनी किला लड़की खिड़की खीरा महिला खिचड़ी किलकारी लाल नीले हरा काले बताओ, ये कैसी-कैसी आवाज़ें करते हैं? नाम लिखो");
		String jsonUpdateValidComplexityGrade = js.toString();
		given().
			spec(getRequestSpec(contentType, validuserId)).
			body(jsonUpdateValidComplexityGrade).
		with().
			contentType(JSON).
		when().
			post("/v1/language/tools/gradeLevelComplexity/hi/").
		then().
			spec(get200ResponseSpec());
		
		//Get the complexity value
		setURI();
		Response R = 
		given().
			spec(getRequestSpec(contentType, validuserId)).
		when().	
			get("/v1/language/tools/gradeLevelComplexity/hi").
		then().
			spec(get200ResponseSpec()).
		extract().
			response();
		
		// Extract the response
		JsonPath jPath = R.jsonPath();
		Float avgComplexity = jPath.get("result.text_complexity.averageTotalComplexity");
		System.out.println(avgComplexity);
		
		// Update text the complexity value for grade-1 first language(higher than grade-2)
		
		setURI();
		JSONObject js1 = new JSONObject(jsonUpdateSingleTextbook);
		js1.getJSONObject("request").put("gradeLevel","Grade 1").put("text", "चर्चा करो मेरा गाँव चित्र चर्चा करो खमनोर बस स्टेंड चर्चा करो मेले की मौज़ चर्चा करो बिल्ली और चूहा चित्रों पर बातचीत करें और कहानी बनवाएँ। चर्चा करो रेखा चित्र अंगुली घुमाओ पेंसिल घुमाओ घुमाओ चर्चा करो अंगूठे की चाप बाले चित्र ऊपर बने चित्रों की पहचान कराएँ। इनके बनने की प्रक्रिया पर चर्चा करें। रेखाओं पर पेंसिल घुमवाएँ। कविता गाओ बालगीत आ आ लल्ला ले रसगुल्ला मचा रहा क्यों रो रो हल्ला ले यह दोना अब मत रोना जल्दी खाकर मुँह को धोना पिंकी ने एक पिल्ला पाला कुछकुछ पीला , कुछ-कुछ काला टॉमी उसका सुंदर नाम हाथ उठाओ करे सलाम। सूरज ऐसे चमक रहा है, सोना जैसे दमक रहा है। रातों में यह चिप जाता है, सुबह सवेरे दिखा जाता है। इसके बिना अन्धेरा है, अम्बर इसका डेरा है। चिड़िया के घर न्योता है देखें क्या-क्या होता है मुर्गी चावल लाएगी चिड़िया खीर पकाएगी चिड़िया तुम्हें बुलाएगी मीठी खीर खिलाएगी मुन्नी हो जाओ तैयार देखो चिड़िया का घर-बार मछली तुम हो जल की रानी, रह सकती हो ना बिन पानी। लहर-लहर कर आती हो, मचल-मचल कर जाती हो। करती हो बस तुम मनमानी, मछली रानी, मछली रानी। हुआ सवेरा चिड़ियाँ बोली बच्चों ने तब आँखें खोली अच्छे बच्चे मंजन करते मंजन करके कुल्ला करते कुल्ला करके मुँह को ढोते मुँह धोकर के रोज नहाते रोज नहाकर खाना खाते खाना खाकर पढ़ने जाते। वातावरण निर्माण के लिए बालगीतों को गाएँ । सभा, समारोह, पर्व आदि पर बच्चों से मंच पर प्रस्तुत कराएँ। जिन बालगीतों को आगे बढ़ाया जा सकता है उन्हें आगे बढ़ावाएँ। उमड़-घुमड़ के आए बादल काले, ढोले, नीले बादल बिजली के संग आए बादल आसमान में छाए बादल घड़-घड़-घड़-घड़ करते बादल ताल-तलैया भरते बादल गुड़िया मेरी रानी है, मलगती बड़ी सयानी है। गोरे-गोरे गाल है, लंबे-लंबे बाल हैं। आँखें नीली-नीली हैं, साड़ी पीली-पीली हैं। मैं तो सो रही थी मुझे मुर्ग ने जगाया बोला कुकडूँ-कूँ। मैं तो सो रही थी मुझे बिल्ली ने जगाया बोली म्याऊँ-म्याऊँ। मैं तो सो रही थी मुझे मोटर नइ जगाया बोली पों-पों-पों। मैं तो सो रही थी मुझे अम्मा ने जगाया बोली उठ-उठ-उठ। सड़क बनी है लम्बी चौड़ी जिस पर जाती मोटर दौड़ी स्कूटर भरते है फर्राटे रिक्शा तांगे आते-जाते दुर्घटना से यदि हो बचना बाँयी तरफ हमेशा चलना। चक-चक चैया चक-चक चैया, चक-चक चैया घूम रहा मोटर का पहिया, बैठे उसमें मैं और भैया, नाचें गाएँ, ता ता थैया। बारिश आई भरे तलैया तले पकौड़ी मेरी मैया। तले पकौड़ी मेरी मैया। चक-चक चैया, चक-चक चैया बच्चों के साथ चित्र पर बातचीत करें। जैसे तुमने पहिया कहाँ-कहाँ लगा देखा है? उन चीजों के नाम बताओ, जिनमें पहिया होता है? यदि पहिया नहीं होता तो क्या होता? इनमें से तुमने किसकी सवारी की है। जिसकी सवारी की है, उसे रेखा खींचकर मिलाओ। सुनें और बोलें ऐसे नाम जिनमें मो आता है मोर मोठ मोटा मोल ऐसे नाम जिनमें ट आता है टमाटर टमटम मटर बटन ऐसे नाम जिनमें र आता है रबर रस रहट रजाई मोटर शब्द की पहचान कराएँ मोटर मोटर शब्द की पहचान करो और घेरा लगाओ कार ऊँट मोटर मोटर मोर रेल चक बस मोटर मोटर की पहचान कराएँ पहचानो और रेखा खींचकर मिलाओ पहचानो और घेरा लगाओ मोगरा समोसा अनमोल मोरनी टमाटर फाटक मटका खाट रथ औरत अखबार रमज़ान पढ़ो मोटर मोर लिखो नीचे दिए गए चित्रों में पहिये लगाओ रेल का खेल आओ आओ खेलें खेल, सब जाओ रेल, दो मिलकर इंजिन बन जाओ, छुक-छुक करके रेल चलाओ। झाडी हरी दिखाऊँगी, सीटी तुरन्त बजाऊँगी, तब सब धीरे-धीरे चलना, छुक-छुक करके आगे बढ़ना। बच्चों के साथ चित्र पर बातचीत करें। बच्चों के साथ रेल बनाकर खेल के साथ दोहराएँ। बच्चों के ऐसे नाम बोलने को कहें जिनमें रे और ल की आवाज आती हो। रेल शब्द की पहचान कराएँ रेल रेल शब्द को पहचानो और घेरा लगाओ खेल रेल फल रेल तेल रेल रे और ल की पहचान कराएँ रेल पहचानो और रंग भरो रे में रंग भरो ल में रंग भरो ऐसे नाम जिनमें रे आया हो, उस पर घेरा बनाओ करेला रथ गुब्बारे ऐसे नाम जिनमें ल आया हो, उस पर घेरा बनाओ लड़की फूल लटटू इन नामों में रे और ल पर घेरा बनाओ तारे कल बल दल रेशमा पल नरेश सन्तरे गुब्बारे करेला सुनें और बोलें ऐसे नाम जिनमें र आता है रतन रमकू रमन रजनी ऐसे नाम जिनमें रे आता है रेखा रेशम रेल रेवाड़ी पहचान कराएँ लिखो रेल मोल पेंसिल फेरो और रंग बिरंगी रेल बनाओ रंग भरो चित्र बनाओ अन्य कागज़ पर अंगूठे अँगुलियों की छाप लगवाकर चित्र बनवाएँ। बने हुए चित्रों को कक्षा में प्रदर्शित करें। चर्चा करो जंगल की सैर तीन साथी एक था हाथी। उसकी थी लम्बी सूंड और चौड़े कान उसकी एक दोस्त थी बकरी। दोनों साथ-साथ जंगल में जाते। चित्रों पर इस प्रकार बातचीत करें की कहानी बच्चों के समझ में आ जाए। हाथी डाली झुकाता और बकरी पत्ते चरती। एक दिन दोनों गए जंगल में। वहाँ बेर का पेड़ भी था। हाथी ने पेड़ हिलाया। बकरी जल्दी-जल्दी बेर खाने लगी। उस पेड़ पर चिड़िया का एक घोंसला था। घोंसले से चिड़िया का एक बच्चा पाने में गिरा। बकरी उसे बचाने पानी में गई। वह भी डूबने लगी। हाथी ने दोनों को सूंड से पकड़ा और बाहर निकाला। कुछ दिनों में चिड़िया का बच्चा बड़ा हो गया। वे तीनों दोस्त बन गए। बताओ कहानी में आए तीनों दोस्तों के नाम बताओ। तुम्हारे दोस्त कौन-कौन हैं? तुम भी अपने दोस्तों के नाम बताओ। चित्र देखकर बताओ, इनको क्या-क्या खाना पसन्द है? ऐसे नाम बताओ जो च ब क का से प्रारंभ होते हों चरना चरखा चम्मच चतुर बस बकरा बछड़ा बतख कबूतर कछुआ ककड़ी कमल काजल कान काका कार पहचान कराएँ कान बकरी चरना चित्रों को उनके नाम से मिलाओ। कान मोटर बकरी रेल चम्मच सामान शब्द पर घेरा लगाओ पहचान कराएँ कान बकरी चरना पहचानो और रंग भरो वर्ण को शब्द से मिलाओ कबूतर चमक काला सेब बतख काजल चढ़ाना काचर आ की मात्रा की पहचान कराएँ पहचानो और घेरा लगाओ आ की मात्रा वाले वर्णा पर रात चक मामा काका टर नाना कल लाना टाल टल पढ़ो मोटर रेल काक बकरा लट कल काला लाल बाल चार बाबा केर काका बाला चेला चाट लिखो रेल काक लट बाबा बेर काच लाल बाल काका चाल बाट बचा काका काला चाट चाटा कल देखेंगे ओ रे चींटा मुझे हाथी पीटा काहे से? कान से। तू वहाँ क्यों गया था? खेलने। तुझे खेलने भेजा था कि हाथी को ठेलने। चल अब हाथ मुँह धो ले, खाना खा ले, हाथी को कल देखेंगे इधर ही बुला लेंगे। बच्चों से चर्चा करें- हाथी और चींटा कौनसा खेल खेल रहे होंगे? और हाथी की लड़ाई कैसे हुई होगी? अगर हाथी सामने आ गया तो चींटा उससे क्या बातें करेगा? हाथी व चींटे का मुखौटा लगाकर बातचीत करो। सुनें और बोलें नली कान नथ नीला कील थन हाथी थप्थप थकान थरमस हाथी, कान, हाथ शब्द की पहचान कराएँ हाथी कान हाथ शब्दों को चित्रों से मिलाओ कान हाथ हाथ हाथी हाथी कान पहचान कराऐं हाथी हाथ कान पहचानो और घेरा लगाओ सुनें, बोलें और अन्तर पहचानो कल कील हाथ हाथी पहचानो और घेरा लगाओ नक़ल सफल महल चपल नल नथ सपेरा थकान जमीन नट चहक काला कह चारा करेला ई की मात्रा वाले शब्दों पर घेरा लगाओ चील कील काल नील लीली हील टीन टीका टका लीक पढ़ो कल काल कील चल चाल चील कह कहा कही टक टका टाकी चर चरा चरी थल थाल थाली नर नार नारी नथ नाथ नत्थी लिखो नल नाली नाला टनटन चालाक कटर हीरा थाली चाकरी लहरी कान काला कील काली थाल इनकी आवाज निकालो पेंसिल फेरो और रंग भरो। दाल बाटी चूरमा दाल-बाटी चूरमा, खाकर बन जा सुरमा। दाल दुलारी, सबकी प्यारी, बाटी की तो बातें न्यारी। घी-शक्कर का मेल निराला, बने चूरमा सबसे आला। आओ बाटी दाल बनाएँ, मिलकर सारे मौज मनाएँ। बच्चों से चर्चा करें। आपके घर में दाल बाटी चूरमा कब-कब बनाया जाता है? बाटी की जैसे खाने की कौन-कौनसी चीजों गोल होती है? पहचानो दाल चूरमा आओ पहचानो और घेरा लगाओ दरवाजा सफ़ेद दाद दल मल मन रमन मदन आम बुआ आई आजा ओला ओज ओर आओ चित्र को उनके नाम से मिलाओ टमाटर	थाली	रथ	कान	हाथी	आम	बगुला	दरवाज़ा तुम्हें जो खाना अच्छा लगता है। उसे रेखा खींचकर मिलाओ पढ़ो आओ आम दाम बादल बाल हाथ बनाओ मदद मलहम दलबल मकान महल काले बादल आओ ना। हाथी बनकर आओ ना। लगाकर शब्द बनाओ कान मात्रा लगाकर शब्द बनाओ आ की मात्रा से ई की मात्रा से चीनी कहानी ए की मात्र से हरे मेरे चरे काले चले दिए गए वर्णा मात्राओं शब्द बनाओ लट हाथी दिए गए शब्दों से वाक्य बनाओ दादारेल मोटर मामा चलाओ आओ मोना लाओ थाली चली हाथी चला टमाटर कल नल था मामा मोटर लाओ। अपनी पसंद का चित्र बनाओ और उसमें रंग भरो चर्चा करो बाजार चलें टिपिक-पाँ-फुर्र हम स्कूल में आते ही खेलते हैं। भाग-दौड़ करते हैं। लटकते हैं। खिड़की की जालियों पर चढ़ाते हैं। बैठते हैं। उठते हैं। हाथ हिलाते हैं। पाँव हिलाते हैं। पंजों पर चलते हैं। फिर गोला बनाकर बैठ जाते हैं। प्रार्थना के समय आँख बंद कर लेते हैं। हल्के से आँख खोलकर देख भी लेते हैं। प्रार्थना के बाद कुछ देर चुपचाप बैठना होता है। बच्चों से बातचीत करें। तुम कौन-कौनसे खेल खेलते हो? कौनसे खेलो में तुम्हे खेल सामत्री की जरुरत पड़ती है? बिना खेल सामग्री के कौनसे खेल खेले जा सकते है? विभिन्न की आवाजों से बच्चों को परिचित करवाएँ जैसे टपकता पानी पक्षियों के उड़ने की आवाजें गाड़ी के हॉर्न की आवाज स्कूल की घण्टी की आवाज आदि। चुपचाप यानी एकदम चुपचाप। कोई भी कुछ नहीं बोलता। सब एकदम चुप। फिर न जाने क्या-क्या सुनाई देता है। क्या सुनाई देता है? यह हर कोई बताता है। टिपिक, टिपिक फुर्र, फुर्र पाँ, पाँ टन, टन डम, डम अगर तुम भी थोड़ी देर आँख बंद करके बैठोगे तो तुम्हें भी बहुत कुछ सुनाई देगा। सुनें और बोलें आँख खिड़की चखना सड़क खिचड़ी खटिया आँख, खिड़की शब्दों की पहचान कराएँ आँख खिड़की पहचान कराएँ आँख खिड़की पहचानो और रंग भरो ख वाले खाने में खि वाले खाने में रंग भरो ख वाले गुब्बारे में पहचानो और घेरा लगाओ खरबूजा चखना खजूर माखन राख भेड़ मेड़ गुड़ सड़क लड़की इ की मात्र वाले वर्णा पर घेरा लगाओ किवाड़ गिलास गिलहरी गिनती चिमनी मिलना सिखाना महिला कपिल समाधि पढ़ो खरल दाखिल राखी खड़खड़ खड़े नाड़ा लड़का कड़कड़ खड़िया टिकटिक खट-खट नमक बिकना बिका निहार किचकिच नीम बालक नानक थाली लिखो चिमनी किला लड़की खिड़की खीरा महिला खिचड़ी किलकारी लाल नीले हरा काले बताओ, ये कैसी-कैसी आवाज़ें करते हैं? नाम लिखो");
		String jsonUpdateInvalidComplexityGrade = js1.toString();
		given().
			spec(getRequestSpec(contentType, validuserId)).
			body(jsonUpdateInvalidComplexityGrade).
		with().
			contentType(JSON).
		when().
			post("/v1/language/tools/gradeLevelComplexity/hi/").
		then().
			spec(get400ResponseSpec());		
	}
	
	// Update complexity with non-indian language
	
	@Test
	public void updateComplexityWithNonIndianLanguageExpect4xx(){
		
		setURI();
		given().
			spec(getRequestSpec(contentType, validuserId)).
			body(jsonUpdateSingleTextbook).
		with().
			contentType(JSON).
		when().
			post("/v1/language/tools/gradeLevelComplexity/en/").
		then().
			spec(get400ResponseSpec());		
	}
	
	// Text analysis with text lies within the complexity value's range
	
	@Test
	public void textAnalysisWithValidTextExpectSuccess200(){
		
		setURI();
		Response R =
		given().
			spec(getRequestSpec(contentType, validuserId)).
			body(jsonTextAnalysisValid).
		with().
			contentType(JSON).
		when().
			post("/v1/language/tools/textAnalysis/hi/text/").
		then().
			spec(get200ResponseSpec()).
		extract().
			response();
		
		JsonPath jPath = R.jsonPath();
		String avgComplexity = jPath.get("result.text_complexity.averageTotalComplexity");
		System.out.println(avgComplexity);
	}
	
	// Text analysis with text lies within the complexity value's range of more than one grade

	@Test
	public void textAnalysisValidTextMultipleGradesExpectSuccess200() {
		setURI();
		Response R =
		given().
			spec(getRequestSpec(contentType, validuserId)).
			body("").
		with().
			contentType(JSON).
		when().
			post("/v1/language/tools/textAnalysis/hi/text/").
		then().
			spec(get200ResponseSpec()).
		extract().
			response();
		
		JsonPath jPath = R.jsonPath();
		String avgComplexity = jPath.get("result.text_complexity.averageTotalComplexity");
		System.out.println(avgComplexity);
	}
	
	// Text analysis with text which doesn't have complexity values
	@Test
	public void textAnalysisForTextWithNoComplexityExpectSuccess200() {
		
		setURI();
		JSONObject js = new JSONObject(jsonTextAnalysisValid);
		js.getJSONObject("request").put("gradeLevel","Grade 1").put("text", "ದಣಿದ ತನಕ ಹೋಗಿ ಹೋಗಿ ಸುಮಾರು ಬಳಸುದಾರಿಯನ್ನು ರಚಿಸಿ, ನಂತರ ಒಂದು ಬಳಸುದಾರಿ ಮಾಡಲು ಕಮ್, ವೃತ್ತಾಕಾರದಲ್ಲಿ ಅವನ ಸುತ್ತ ಒಂದು ವಲಯದಲ್ಲಿ ಸುಮಾರು ಗುಂಡಗೆ, ನಂತರ ಮತ್ತು ಬೇಸರ ಪಡೆಯಲು,. ನಂತರ ಪ್ರತಿ ಸಂಬಂಧ ಇಲಿಗಳಲ್ಲಿ ಕಡಿಮೆ ಗುರುಗುಟ್ಟುವುದು ಒಂದು  ಹಾಗೂ ವಿದೇಶಾಂಗ, ಎಲ್ಲಾ ದಣಿದ ಕೊಲ್ಲಲ್ಪಟ್ಟರು ನಾವು ಕುಳಿತು , ನಿದ್ರೆ, ನಿದ್ರೆ ಹೋಗಿ, ಅವರು ನಾವು  ನೋಡಲು ಪ್ರಾರಂಭಿಸಿದರು. ಬರಲು ಬಳಸುದಾರಿಯನ್ನು ಮಾಡಿ. ಡಯಲ್ ಸ್ಯಾಕ್ಸ್ ಶಿಕ್ಷಕ  ಶಿಕ್ಷಕ ಮತ್ತು ಹಸುಗಳು ಕವನ ಸೋತಿತು ಮಕ್ಕಳು ತೆಗೆದುಕೊಂಡಿತು. ಪಿಕ್ಚರ್ಸ್ ಮಾತನಾಡಲು.  ಸುತ್ತಿನಲ್ಲಿ ಆಟಗಳು. ಥಿಂಕ್ ಮತ್ತು ನೀವು ಕೆಳಗೆ ಪಟ್ಟಿ ಸಂದರ್ಭಗಳಲ್ಲಿ ಏನು ಎಂಬುದನ್ನು ಹೇಳಿ? ಬಿ ಹಿಂದಕ್ಕೆ ಅರಣ್ಯದಲ್ಲಿ ಕಚೇರಿಗೆ ನಾಯಿ, ಅವರು ಮೌಸ್ ಕಂಡಾಗ ಬೆಕ್ಕು ಸಿಂಹ ಹೆದರುತ್ತದೆ.  ಆತಂಕಗಳು. ಸಾಲು ಶೇಕ್ ಸೆಳೆಯುತ್ತವೆ.  ಇಲಿ ಹಾವು ಹುಲಿ ಬೆಕ್ಕು ಹಕ್ಕಿ ಮೊಲದ ಜೊತೆ ಈಗಲ್ ವಂಚಕ ಮೇಕೆ ಮಗು ಹಲವಾರು ಒಂದುಗೂಡಿಸಬಹುದು. ವಿವಿಧ ಸಮರ್ಥ ಶಿಕ್ಷಕ ಮಕ್ಕಳು ಅವಕಾಶ ನಿರೂಪಿಸಲು . ನೀವು ನಿಮ್ಮ ಭಾಷೆಯಲ್ಲಿ ಏನು ಹೇಳುತ್ತಾರೆ? ಅವರ ಹೆಸರುಗಳು ಬರೆದುಕೊಳ್ಳಿ. ಪಠ್ಯದಲ್ಲಿ ಸುತ್ತುಗಳ ಮಾಡುವ ಉದ್ದೇಶ ಮತ್ತು ಆಟದ ಬಗ್ಗೆ ಹೇಳಲಾಗುತ್ತದೆ. ಪಾಲುದಾರರು ಆಡಿದ ಆಟಗಳು ವ್ಯಾಪ್ತಿ ಕೈ ಹಿಡಿಯಲು ಮತ್ತು ಹಾಡುಗಳನ್ನು ಹಾಡಲು. ನೀವು ಬ್ಯಾಸ್ಕೆಟ್ನೊಳಗೆ ಮೂಲಕ ಆಟವನ್ನು ಕಾಣಿಸುತ್ತದೆ. ನೀವು ಆಟಗಳು ವಹಿಸುತ್ತದೆ ಹೇಳಿರಿ? ಓದಿ ನೋಡಿ ಮತ್ತು ವಿವಿಧ  ಮಕ್ಕಳು ತಮ್ಮ ಗುಣಲಕ್ಷಣಗಳನ್ನು ಅಥವಾ ಚಿಹ್ನೆಗಳು ಮೂಲಕ ಅಥವಾ ಧ್ವನಿಯ ಮೂಲಕ ವಿವರಿಸಲು ಅವಶ್ಯಕತೆ ಟೀಚಮಚ ಕಾರ್ನ್ ಗೂಬೆ ಕಬ್ಬಿನ ಬೆಕ್ಕು ಶಿಕ್ಷಕ ಶಿಕ್ಷಕ ಅರ್ಥ. ಅಂತೆಯೇ, ನಿಯಂತ್ರಕ ಚಕ್ರ  ದೆಹಲಿ ಮೂಲಕ ನೀವು ಮಾತನಾಡಲು ಪದಗಳನ್ನು ಆಲೋಚಿಸುತ್ತೀರಿ ಮತ್ತು ಪುಟದ ಪಠ್ಯದಲ್ಲಿ ಬರೆಯಲು ಪದ ಅಫೇರ್. ಅರ್ಥಾತ್ ಇದೇ ಬರೆಯಲು ಮಾಡುವ ಮತ್ತು ಅದನ್ನು ಓದಲು. ಕೆಕೆಆರ್ ಇಂತಹ ಆಟಗಳು ಹೆಸರನ್ನು ಬರೆಯಲು ಸಕ್ಕರೆಗಳ. ನೀವು ಕ್ರೀಡೆಗಳು ಕ್ರಿಯೆಯನ್ನು ಒಂದು ಆಡಿದ್ದೇನೆ. ಕೆಲವು ಆಟಗಳು ಎಲ್ಲಾ ಇದು ಇಂತಹ ಕ್ರಿಯಾಶೀಲ ಇವೆ. ಇಂತಹ ಆಟಗಳು ಹೆಸರುಗಳ ಪಟ್ಟಿ ಕೆಳಗೆ ಬರೆಯಿರಿ. ಮಕ್ಕಳಿಗೆ ಸಹಾಯ ಅಧ್ಯಾಪಕರ ಹೆಸರು ಬರೆಯಲು ಶಿಕ್ಷಕ ಆಡುವ ಅಂತಹ ಕಬಡ್ಡಿ  ಆಟಗಳು ಕ್ರೀಡೆಗಳು. ವಿವಿಧ ಕ್ರೀಡೆಗಳಲ್ಲಿ ಶಿಕ್ಷಕ  ಮಕ್ಕಳು ತನ್ನ ಶಿಕ್ಷಕ ವಿವರಿಸಲು. ಮಕ್ಕಳ ತಿಳಿಸಲಾಯಿತು. ಹೊವೆ ಮಾನ್ಯ ಮಾಡಲಾಗುವುದು. ಏನು ಜಾಗವನ್ನು ಪದ ಬರುತ್ತದೆ? ಸಮಯ ಪಠ್ಯ ಸಂಬಂಧ ಪದ ಬರೆಯಲು ಬಂದಿದ್ದಾರೆ. ಸಣ್ಣ   ಒಂಬತ್ತು ಹನ್ನೊಂದು ಪಠ್ಯ ಪ್ರಕಾರ ಹೆಸರಿಸಲಾಗಿದೆ. ದೊಡ್ಡ ವೃತ್ತಾಕಾರದಲ್ಲಿ ಇಲಿ ಬೆಕ್ಕು ನಾಯಿ ರೇಸಿಂಗ್ ಮಾಡಲಾಗುತ್ತದೆ. ಬೆಕ್ಕು, ನಾಯಿ, ಇಲಿಗಳು, ಭಾವಿಸುತ್ತೇನೆ ಮತ್ತು ನೀವು ಏನು ಬರೆಯಲು? ಚಲಾಯಿಸುವ ಆಯಾಸಗೊಂಡಿದ್ದು ಎಲ್ಲಾ ದಿನ ಕೆಲಸ ಮಾಡಿದ ನಂತರ ನೀವು ಏನು ನಂತರ? ಟೈರ್ ಜಟಿಲ ಹುಡುಗಿ  ँ ಚಾವೊ. ವಿವಿಧ  ಮಕ್ಕಳು ಸಹಕರಿಸಲು ಸಹಪಾಠಿ. ಶಿಕ್ಷಕ ಮಾಡಲು ಅಗತ್ಯವಿದೆ  ಇತರ ಕ್ರಿಯೆಯನ್ನು ಮಾಜಿ  ಪುಟ ಕಾಗದದ ಹುಲ್ಲು ಅಥವಾ ಐಸ್ಕ್ರೀಂ ಹುಡುಗಿ ಲೆಗ್ ಪಟ್ಟಿಗಳನ್ನು ಮೇಲೆ ಉಪಯೋಗಿಸದ ಕಾಗದದ ವಿಷಯ ಕಲಿಸುತ್ತದೆ ಅದೇ ಗೇಜ್ ಮೂರು ಹೊಂದಿವೆ. ಮೂರು ಸಮ ಭಾಗಗಳಾಗಿ ತೋರಿಸಿರುವಂತೆ ಪಟ್ಟಿಗಳನ್ನು ಸಾಮಾನು ಇದು ಬಗ್ಗಿಸುವುದು. ಬಾಗಿದ ಬೆಲ್ಟ್ ಬೆಲ್ಟ್ ಮೇಲೆ ಹೊಯಿ ಎರಡನೇ ಬಾಗಿದ  ಸ್ಥಾಪಿಸುವುದು. ಮೂರು ಪ್ರಕಾರ ಗು ಪಟ್ಟಿಗಳನ್ನು ँ. ಮೂರು ಇತರ ಎಲೆಗಳು ಹಿಡುವಳಿ ಪಟ್ಟಿಗಳನ್ನು ಎಳೆಯಿರಿ. ಮೂರು ಪಟ್ಟಿಗಳನ್ನು ಮತ್ತೊಮ್ಮೆ ಒಂದು ಸೆಟ್ ಅಪ್ ಒಂದು ಮೂಲೆಯಲ್ಲಿ ಪಡೆದುಕೊಳ್ಳಬಹುದು. ಗಿಗ್ ಅಪ್ ಆಗಿತ್ತು. ಹುಡುಗಿ ಮೇಲೆ ಹುಲ್ಲು ಅಥವಾ ಐಸ್ಕ್ರೀಂ ಸ್ಪಿನ್ ಸಿದ್ಧ ಹುಡುಗಿ. ಸ್ಪಿನ್ ಡ್ರೈವ್ ಪ್ರಕಾರ. ವಿಭಿನ್ನವಾಗಿ ಮಕ್ಕಳು ಹೆಚ್ಚಿನ ಸಮಯ ಮತ್ತು ಸಹಾಯ ಅಗತ್ಯವಿದ್ದರೆ. ಅವನ ಸಹಪಾಠಿಗಳಿಗೆ ಮತ್ತು ಶಿಕ್ಷಕರು ಸಹಯೋಗ. ಗೋಡೆಗಳು ಮತ್ತು ಅಂಗಣದ ಮೇಲೆ ರಚಿಸಲಾಗಿದೆ. ಈ ಮೊಗ್ಗುಗಳು ಸುಣ್ಣ ಮತ್ತು ಕಾವಿಮಣ್ಣು ತಯಾರಿಸಲಾಗುತ್ತದೆ. ಮಕ್ಕಳು ಮತ್ತು ಗೋಡೆಗಳು ಮತ್ತು ಅಂಗಣದ ಚರ್ಚಿಸಿ. ಮೊದಲ ಮಕ್ಕಳ ಮೇಲೆ ಸರಳ ಆಕಾರಗಳನ್ನು ಪಡೆಯಿರಿ ಅಭ್ಯಾಸ. ಮಕ್ಕಳಿಗೆ ಶಿಕ್ಷಕನಾಗಿ ವಿವಿಧ ಶಿಕ್ಷಕ ವಿವರಿಸಿ.");
		String jsonTextAnalysisKannada = js.toString();
		Response R =
		given().
			spec(getRequestSpec(contentType, validuserId)).
			body(jsonTextAnalysisKannada).
		with().
			contentType(JSON).
		when().
			post("/v1/language/tools/textAnalysis/ka/text/").
		then().
			spec(get200ResponseSpec()).
		extract().
			response();
		
		JsonPath jPath = R.jsonPath();
		String avgComplexity = jPath.get("result.text_complexity.averageTotalComplexity");
		System.out.println(avgComplexity);
	}
	
	// Text analysis with text which doesn't support complexity calculation
	
	@Test
	public void textAnlaysisForUnsupportedLanguageExpect4xx(){
		
		setURI();
		given().
			spec(getRequestSpec(contentType, validuserId)).
			body(jsonTextAnalysisValid).
		with().
			contentType(JSON).
		when().
			post("/v1/language/tools/textAnalysis/en/text/").
		then().
			spec(get400ResponseSpec());
	}	
}
