{
	"model": {
		"scene1_body" : "It was the Annual Haircut Day for Sringeri Srinivas.",
		"scene2_body" : "Sringeri Srinivas left home as usual to go to the local barber.",
		"scene3_body" : "But the barber said, \"Today, I have no time to cut such long hair!\"",
		"scene4_body" : "Feeling sad, Sringeri Srinivas went back home to ask his wife for help.",
		"scene5_body" : "But his wife said, \"Today, I have no time to cut such long hair!\"",
		"scene6_body" : "Feeling a little angry, Sringeri Srinivas went to his friend, the tailor.",
		"scene7_body" : "But the tailor said, \"Today, I have no time to cut such long hair!\"",
		"scene8_body" : "Now a little worried, Sringeri Srinivas went to one more friend, the carpenter.",
		"scene9_body" : "But the carpenter said, \"Today, I have no time to cut such long hair!\"",
		"scene10_body" : "Poor Sringeri Srinivas. It seemed no one would cut his hair on this Annual Haircut Day.",
		"scene11_body" : "In tears, he walked off by himself past the village forest.",
		"scene12_body" : "He sat near a cave and cried loudly.",
		"scene13_body" : "\"The day is nearly over. How can I keep my promise to cut my hair? Oh God, help me!\"",
		"scene14_body" : "The tiger sleeping peacefully inside the cave was very disturbed by all the noise.",
		"scene15_body" : "He came out, roaring, waving his giant paws at Sringeri Srinivas.",
		"scene16_body" : "Poor Sringeri Srinivas was so scared, so scared, so scared that ...",
		"scene17_body" : "... all the hair fell off his head!",
		"scene18_body" : "Sringeri Srinivas ran all the way back to the village. The tiger went back to sleep.",
		"scene19_body" : "Now, Sringeri Srinivas will not need a haircut for a very long time.",
		"scene20_body" : "Find the Barber.",
		"scene21_body" : "Find the Carpenter.",
		"scene22_body" : "Match the tools to the people.",
		"scene23_body" : "Take me home. Take each person to their home.",
		"kettle_title" : "Kettle",
		"kettle_synonyms" : "Synonyms: Teapot",
		"kettle_hindi" : "Hindi: केटली",
		"kettle_usage" : "Kettle is used for boiling tea.",
		"kettle_rhyme" : "Rhyme: I'm a little Teapot...",
		"scene20_hint" : "Barber has Scissors to Cut hair.",
		"scene21_hint" : "Carpenter has a hammer and nail.",
		"scene22_hint" : "Carpenter uses this to cut wood.",
		"scene23_hint" : "The tailor is surrounded by clothers to stitch."
	}
}